tap "homebrew/bundle"

brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "mas"
brew "vim"
brew "coreutils"
brew "gnu-sed"
brew "make"
brew "gawk"
brew "curl"
brew "jump"

# Programming languages
brew "dotnet"
brew "go"
brew "rust"

# Applications
cask "iterm2"
cask "google-chrome"
cask "visual-studio-code"
cask "discord"
cask "docker"

# Applications from App Store
mas "Graphic", id: 404705039
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Spark", id: 1176895641
